%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ---- 本脚本用于测试生成随机数以及随机数组 ---- %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    % ---- 注释 ---- %
        % ---- 本脚本的主要作用是：
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            % ---- 1.测试生成随机数以及随机数组         
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            
            
%% ---- 生成随机数 0或者1
    for ii = 1:1:10
        % ---- 生成随机数
            %{
                ---- 注意 ----
                ---- 注意 ----
                ---- 注意 ----
                    rand是生成0-1之间的随机数
                    round是四舍五入
                    因此round(rand)得到的是0或者1
                ---- 注意 ----
                ---- 注意 ----
                ---- 注意 ----
            %}
            randNum = round(rand);
        % ---- 在命令行显示randNum
            disp(randNum);
    end
% ---- 生成指定长度的0和1数组
    % ---- 生成随机的0和1数组
            %{
                ---- 注意 ----
                ---- 注意 ----
                ---- 注意 ----
                    rand是生成0-1之间的随机数
                    rand(1, num)是生成一行有num个数的0-1之间的随机数
                    round是四舍五入
                    因此round(rand(1, num))得到的是具有num个数的0或者1数组
                ---- 注意 ----
                ---- 注意 ----
                ---- 注意 ----
            %}
            randNumArr = round(rand(1, 10));
        % ---- 在命令行显示randNumArr
            disp(randNumArr);