%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ---- 本函数用于计算指定频段内的每个频点对应的S11的和 ---- %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    % ---- 注释 ---- %
        % ---- 本函数的主要作用是：
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            % ---- 1.计算指定频段内的每个频点对应的S11的和
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            
function scores = getScoresByBand(tmpDataFile)
%% ---- 声明全局变量
    global startIndexOfS11 stopIndexOfS11
%% ---- 加载数据文件
    %{ 
        ---- 注意 ----
        ---- 注意 ----
        ---- 注意 ----
            此处的的tmpDataFile来自executeModel.m。
        ---- 注意 ----
        ---- 注意 ----
        ---- 注意 ----
    %}
    run(tmpDataFile);
%% ---- 计算scores
    % ---- 定义scores，并初始化
        scores = 0;
    % ---- 使用循环求解指定频段内的每个频点对应的S11的和
        %{ 
            ---- 注意 ----
            ---- 注意 ----
            ---- 注意 ----
                由于HFSS输出的仿真参数为复数形式：S(1,:,:) = [9.608966E-001 -2.059262E-001i];，参见ModelExecuteFastDemoDataFile.m文件
                因此，要想计算S11参数，需要对数据进行处理，将复数形式的S11参数转化为实数，然后才能相加，得到scores
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                        % ----         转化公式          ---- %
                        % ---- 20*log10(abs(S(ii,:,:))) ---- %
                        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            ---- 注意 ----
            ---- 注意 ----
            ---- 注意 ----
        %}
        for ii = startIndexOfS11:1:stopIndexOfS11
%                 disp(20*log10(abs(S(ii,:,:))));
            scores = scores + 20*log10(abs(S(ii,:,:)));
        end
end

