%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ---- 本脚本用于得到单个频点的所有开关组合的S11参数图 ---- %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

    % ---- 注释 ---- %
        % ---- 本脚本的主要作用是：
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            % ---- 得到单个频点的所有开关组合的S11参数图
            %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            
            
%% ---- clear and close
    clc;
    clear;
    close all;
%% ---- 加载开关组合数组文件
    SwitchArrayForOneFrequencyPoint_9_97;
%% ---- 得到所有开关组合
    for ii = 1:1:m
        % ---- 生成开关组合
            myCurrentSwitchArray = SwitchArrayOfOneFrequencyPoint(ii, :);
        % ---- 调用函数，得到当前开关组合的工作频率，及其对应的S11参数，并将它们写入文件
            getMessageOfOneSwitchArray(myCurrentSwitchArray);
    end