%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% ---- 本函数用于得到一个数字的HFSS模式的字符串形式 ---- %
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
            
function HFSSName = getHFSSName( number )
%{
    ---- 注意 ----
    ---- 注意 ----
    ---- 注意 ----
        一个数字的HFSS模式的字符串形式就是：
            将一个数字转化为字符串
                如果字符串里面有'.'，则将'.'替换为'_'
                    之所这样做是因为HFSS里面求解频率的命名不支持'.'，所以需要替换为'_'

            例子：
                5       ---->   5
                5.64    ---->   5_64
    ---- 注意 ----
    ---- 注意 ----
    ---- 注意 ----
%}

    % ---- 将number转换为字符串
        numberStringHFSS = num2str(number);
    % ---- 将numberString里面的'.'替换为'_'
        HFSSName = strrep(numberStringHFSS, '.', '_');
end

